chmod.org
#+INCLUDE: ./main.setup
#+TITLE: chmod
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-21

* 개요
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: ko
  :END:      

파일 및 디렉토리의 권한을 변경합니다.

* 설치 방법
  :PROPERTIES: 
  :CUSTOM_ID: how-to-install
  :LANG: ko
  :END:      

# ** Prerequisites
#    :PROPERTIES: 
#    :CUSTOM_ID: prerequisites
#    :LANG_EN:  Prerequisites
#    :LANG_ES:  Requisitos previos
#    :LANG_KO:  필요 사항
#    :LANG_ZH:  先决条件
#    :LANG_JA:  前準備
#    :END:      

** 설치
  :PROPERTIES: 
  :CUSTOM_ID: install
  :LANG: ko
  :END:      

{{{BUILTIN}}}

# ** Installed Packages
#    :PROPERTIES: 
#    :CUSTOM_ID: packages
#    :LANG_EN:  Installed Packages
#    :LANG_ES:  Paquetes instalados
#    :LANG_KO:  설치된 패키지
#    :LANG_ZH:  安装的软件包
#    :LANG_JA:  インストールされたパッケージ
#    :END:      

# ** Check
#    :PROPERTIES: 
#    :CUSTOM_ID: check
#    :LANG_EN:  Check
#    :LANG_ES:  Comprobar
#    :LANG_KO:  확인
#    :LANG_ZH:  检查
#    :LANG_JA:  チェック
#    :END:      

* 사용법
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: ko
  :END:      

** 구조
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: ko
   :END:      

#+BEGIN_SRC sh
chmod [OPTION]... MODE[,MODE]... FILE...)}}}
chmod [OPTION]... OCTAL-MODE FILE...)}}}    
chmod [OPTION]... --reference=RFILE FILE...)
#+END_SRC

파일 및 디렉토리의 권한을 변경합니다. 쓰기, 읽기, 실행 권한에 각각 1비트를 할당하여 총 3비트로 권한을 나타냅니다.

** 설명
   :PROPERTIES: 
   :CUSTOM_ID: description
   :LANG: ko
   :END:      

*** Reference
| 레퍼런스 | 클래스  | 설명                         |
|--------+---------+------------------------------|
| u      | 사용자  | 파일의 소유자                |
| g      | 그룹    | 그 파일의 그룹 멤버인 사용자 |
| o      | 다른 사람 |  |
| a      | 모든 사람 | 셋 모두, "ugo" 와 같다.      |

*** Operator
| 연산자 | 설명                                                  |
|------+-------------------------------------------------------|
| +    | 모드들은 지정된 클래스들에 더한다                     |
| -    | 지정된 클래스들로부터 지정된 모드들은 지운다          |
| =    | 지정된 클래스들을 위해서 지정된 모드들이 정확한 모드들로 만들어지게 된다. |

*** 8 Bits mode
|---+-------------------------+-----+-----|
| # | Permission              | rwx | bin |
|---+-------------------------+-----+-----|
| 0 | none                    | --- | 000 |
| 1 | execute only            | --x | 001 |
| 2 | write only              | -w- | 010 |
| 3 | write and execute       | -wx | 011 |
| 4 | read only               | r-- | 100 |
| 5 | read and execute        | r-x | 101 |
| 6 | read and write          | rw- | 110 |
| 7 | read, write and execute | rwx | 111 |

*** Symbol mode
| 모드 | 이름         | 설명                                      |
|------+--------------+--------------------------------------------------|
| r    | 읽기         | 읽거나 디렉토리 안 내용물의 리스트를 보여준다.   |
| w    | 쓰기         | 파일이나 디렉토리에 쓴다.                        |
| x    | 실행         | 실행하거나 디렉토리 트리로 되돌아간다.           |
| X    | 특수실행     | 실행은 불가하지만 디렉토리 접근은 가능하도록 설정한다. |
| s    | setuid/gid   | 실행시 소유자 혹은 그룹의 권한으로 실행된다.     |
| t    | 스티키(sticky) | 해당 파일의 소유자가 아니면 수퍼유저를 제외하고는 삭제가 불가하다. |

# ** Configuration
#    :PROPERTIES: 
#    :CUSTOM_ID: configuration
#    :LANG_EN:  Configuration
#    :LANG_ES:  Configuración
#    :LANG_KO:  설정
#    :LANG_ZH:  组态
#    :LANG_JA:  設定
#    :END:      

** 옵션
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: ko
   :END:      

- {{{option(-c)}}}, {{{option(--changes)}}} :
  verbose와 비슷하지만 변경되었을 때만 리포트한다.
- {{{option(-f)}}}, {{{option(--silent)}}}, {{{option(--quiet)}}} :
  에러 메세지를 보여주지 않는다.
- {{{option(-v)}}}, {{{option(--verbose)}}} :
  처리된 모든 파일의 진단 결과를 출력한다.
- {{{option(--no-preserve-root)}}} :
  (기본설정) '/'를 사용하지 않는다.
- {{{option(--preserve-root)}}}
- {{{option(--reference)}}} {{{argument(=RFILE)}}} :
  RFILE의 모드를 사용한다.
- {{{option(-R)}}}, {{{option(--recursive)}}} :
  파일들과 디렉토리를 재귀적으로 변경한다.
- {{{option(--help)}}} :
  도움말
- {{{option(--version)}}} :
  버전
- MODE 형태 : '[ugoa]*([-+=]([rwxXst]*|[ugo]))+|[-+=][0-7]+'

# ** Examples
#    :PROPERTIES: 
#    :CUSTOM_ID: examples
#    :LANG_EN:  Examples
#    :LANG_ES:  Ejemplos
#    :LANG_KO:  사용 예
#    :LANG_ZH:  例子
#    :LANG_JA:  例
#    :END:      

# * See also
#   :PROPERTIES: 
#   :CUSTOM_ID: seealso
#   :LANG_EN:  See also
#   :LANG_ES:  Ver también
#   :LANG_KO:  관련 항목
#   :LANG_ZH:  相关主题
#   :LANG_JA:  関連項目
#   :END:      

# * References
#   :PROPERTIES: 
#   :CUSTOM_ID: references
#   :LANG_EN:  References
#   :LANG_ES:  Referencias
#   :LANG_KO:  참고자료
#   :LANG_ZH:  参考
#   :LANG_JA:  参考
#   :END:      
