ko/chmod.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<title>chmod</title>
<!-- 2018-02-25 Sun 05:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="chmod - 리눅스 명령어">
<meta name="description" content="파일 및 디렉토리의 권한을 변경합니다. ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="chmod - 리눅스 명령어">
<meta property="og:description" content="파일 및 디렉토리의 권한을 변경합니다. ">
<meta name="twitter:title" content="chmod - 리눅스 명령어">
<meta name="twitter:description" content="파일 및 디렉토리의 권한을 변경합니다. ">
</head>
<body>
<div id="content">
<h1 class="title">chmod</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">개요</a></li>
<li><a href="#how-to-install">설치 방법</a>
<ul>
<li><a href="#install">설치</a></li>
</ul>
</li>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#description">설명</a>
<ul>
<li><a href="#sec-3-2-1">Reference</a></li>
<li><a href="#sec-3-2-2">Operator</a></li>
<li><a href="#sec-3-2-3">8 Bits mode</a></li>
<li><a href="#sec-3-2-4">Symbol mode</a></li>
</ul>
</li>
<li><a href="#options">옵션</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview"><a id="sec-1" name="sec-1"></a>개요</h2>
<div class="outline-text-2" id="text-overview">

<p>
파일 및 디렉토리의 권한을 변경합니다.
</p>
</div>
</div>

<div id="outline-container-how-to-install" class="outline-2">
<h2 id="how-to-install"><a id="sec-2" name="sec-2"></a>설치 방법</h2>
<div class="outline-text-2" id="text-how-to-install">

</div>

<div id="outline-container-install" class="outline-3">
<h3 id="install"><a id="sec-2-1" name="sec-2-1"></a>설치</h3>
<div class="outline-text-3" id="text-install">

<p>
기본으로 내장되어 있는 명령어입니다.
</p>
</div>
</div>
</div>

<div id="outline-container-usage" class="outline-2">
<h2 id="usage"><a id="sec-3" name="sec-3"></a>사용법</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-syntax" class="outline-3">
<h3 id="syntax"><a id="sec-3-1" name="sec-3-1"></a>구조</h3>
<div class="outline-text-3" id="text-syntax">

<div class="org-src-container">

<pre class="src src-sh">chmod [OPTION]... MODE[,MODE]... FILE...)}}}
chmod [OPTION]... OCTAL-MODE FILE...)}}}    
chmod [OPTION]... --reference=RFILE FILE...)
</pre>
</div>

<p>
파일 및 디렉토리의 권한을 변경합니다. 쓰기, 읽기, 실행 권한에 각각 1비트를 할당하여 총 3비트로 권한을 나타냅니다.
</p>
</div>
</div>

<div id="outline-container-description" class="outline-3">
<h3 id="description"><a id="sec-3-2" name="sec-3-2"></a>설명</h3>
<div class="outline-text-3" id="text-description">
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Reference</h4>
<div class="outline-text-4" id="text-3-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">레퍼런스</th>
<th scope="col" class="left">클래스</th>
<th scope="col" class="left">설명</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">u</td>
<td class="left">사용자</td>
<td class="left">파일의 소유자</td>
</tr>

<tr>
<td class="left">g</td>
<td class="left">그룹</td>
<td class="left">그 파일의 그룹 멤버인 사용자</td>
</tr>

<tr>
<td class="left">o</td>
<td class="left">다른 사람</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">a</td>
<td class="left">모든 사람</td>
<td class="left">셋 모두, "ugo" 와 같다.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">Operator</h4>
<div class="outline-text-4" id="text-3-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">연산자</th>
<th scope="col" class="left">설명</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">+</td>
<td class="left">모드들은 지정된 클래스들에 더한다</td>
</tr>

<tr>
<td class="left">-</td>
<td class="left">지정된 클래스들로부터 지정된 모드들은 지운다</td>
</tr>

<tr>
<td class="left">=</td>
<td class="left">지정된 클래스들을 위해서 지정된 모드들이 정확한 모드들로 만들어지게 된다.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3">8 Bits mode</h4>
<div class="outline-text-4" id="text-3-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">#</th>
<th scope="col" class="left">Permission</th>
<th scope="col" class="left">rwx</th>
<th scope="col" class="right">bin</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">0</td>
<td class="left">none</td>
<td class="left">---</td>
<td class="right">000</td>
</tr>

<tr>
<td class="right">1</td>
<td class="left">execute only</td>
<td class="left">--x</td>
<td class="right">001</td>
</tr>

<tr>
<td class="right">2</td>
<td class="left">write only</td>
<td class="left">-w-</td>
<td class="right">010</td>
</tr>

<tr>
<td class="right">3</td>
<td class="left">write and execute</td>
<td class="left">-wx</td>
<td class="right">011</td>
</tr>

<tr>
<td class="right">4</td>
<td class="left">read only</td>
<td class="left">r--</td>
<td class="right">100</td>
</tr>

<tr>
<td class="right">5</td>
<td class="left">read and execute</td>
<td class="left">r-x</td>
<td class="right">101</td>
</tr>

<tr>
<td class="right">6</td>
<td class="left">read and write</td>
<td class="left">rw-</td>
<td class="right">110</td>
</tr>

<tr>
<td class="right">7</td>
<td class="left">read, write and execute</td>
<td class="left">rwx</td>
<td class="right">111</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4">Symbol mode</h4>
<div class="outline-text-4" id="text-3-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">모드</th>
<th scope="col" class="left">이름</th>
<th scope="col" class="left">설명</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">r</td>
<td class="left">읽기</td>
<td class="left">읽거나 디렉토리 안 내용물의 리스트를 보여준다.</td>
</tr>

<tr>
<td class="left">w</td>
<td class="left">쓰기</td>
<td class="left">파일이나 디렉토리에 쓴다.</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">실행</td>
<td class="left">실행하거나 디렉토리 트리로 되돌아간다.</td>
</tr>

<tr>
<td class="left">X</td>
<td class="left">특수실행</td>
<td class="left">실행은 불가하지만 디렉토리 접근은 가능하도록 설정한다.</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">setuid/gid</td>
<td class="left">실행시 소유자 혹은 그룹의 권한으로 실행된다.</td>
</tr>

<tr>
<td class="left">t</td>
<td class="left">스티키(sticky)</td>
<td class="left">해당 파일의 소유자가 아니면 수퍼유저를 제외하고는 삭제가 불가하다.</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-options" class="outline-3">
<h3 id="options"><a id="sec-3-3" name="sec-3-3"></a>옵션</h3>
<div class="outline-text-3" id="text-options">

<ul class="org-ul">
<li><span class="org-programming-option">-c</span>, <span class="org-programming-option">--changes</span> :
verbose와 비슷하지만 변경되었을 때만 리포트한다.
</li>
<li><span class="org-programming-option">-f</span>, <span class="org-programming-option">--silent</span>, <span class="org-programming-option">--quiet</span> :
에러 메세지를 보여주지 않는다.
</li>
<li><span class="org-programming-option">-v</span>, <span class="org-programming-option">--verbose</span> :
처리된 모든 파일의 진단 결과를 출력한다.
</li>
<li><span class="org-programming-option">--no-preserve-root</span> :
(기본설정) '/'를 사용하지 않는다.
</li>
<li><span class="org-programming-option">--preserve-root</span>
</li>
<li><span class="org-programming-option">--reference</span> <span class="org-programming-argument">=RFILE</span> :
RFILE의 모드를 사용한다.
</li>
<li><span class="org-programming-option">-R</span>, <span class="org-programming-option">--recursive</span> :
파일들과 디렉토리를 재귀적으로 변경한다.
</li>
<li><span class="org-programming-option">--help</span> :
도움말
</li>
<li><span class="org-programming-option">--version</span> :
버전
</li>
<li>MODE 형태 : '[ugoa]*([-+=]([rwxXst]*|[ugo]))+|[-+=][0-7]+'
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-21</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
